{
  "_id": {
    "$oid": "6384801da0585fa234e58f18"
  },
  "matchers": [
    {
      "errorRegex": ".*Your free trial has ended and all of your virtual warehouses have been suspended.*",
      "solution": "Your Snowflake destination could not be written to because your Snowflake trial has ended. Please add billing information in the Snowflake web UI to re-enable your Snowflake warehouses or create a new pipeline to load your data into a different destination."
    },
    {
      "errorRegex": ".*User access disabled\\. Contact your local system administrator.*",
      "solution": "Your Snowflake destination could not be written to because user access has been disabled for your Snowflake user. Please re-enable access for this user or create a new pipeline to load your data into a different destination."
    },
    {
      "errorRegex": ".*Your user account has been temporarily locked.*",
      "solution": "Your Snowflake destination could not be written to because your user is temporarily locked. Please unlock this user and edit your destination if necessary. Then try again."
    },
    {
      "errorRegex": ".*Incorrect username or password was specified.*",
      "solution": "Please edit your destination and correct the username / password. Then save the destination then try again."
    },
    {
      "errorRegex": ".*Schema '.*/' does not exist or not authorized.*",
      "solution": "Your Snowflake user does not have the required permissions for your Precog data pipeline to load data into your database.This can be resolved by following these steps, replacing \"<pw>\" with a password.\n      \n      Instructions\n\n      Feel free to adapt these to your internal processes and preferences using the steps below as a guide. Please note however that the permissions detailed below are required for the user's default role.\n      \n      1) Log into Snowflake at https://app.snowflake.com/.\n      2) Select “Classic Console” from the menu on the left.\n      3) You may be asked to sign in again at this point.\n      4) Select “Worksheets” from the toolbar at the top.\n      5) Paste the following into a new worksheet:\n      \n      CREATE OR REPLACE DATABASE precog;\n      CREATE OR REPLACE ROLE precog;\n      CREATE OR REPLACE SCHEMA precog;\n      CREATE WAREHOUSE precog WITH WAREHOUSE_SIZE = 'XSMALL' WAREHOUSE_TYPE = 'STANDARD' AUTO_SUSPEND = 300 AUTO_RESUME = TRUE;\n      GRANT ALL ON WAREHOUSE precog TO ROLE precog;\n      GRANT ALL ON DATABASE precog TO ROLE precog;\n      GRANT ALL ON ALL SCHEMAS IN DATABASE precog TO ROLE precog;\n      CREATE OR REPLACE USER precog PASSWORD = \"<pw>\" LOGIN_NAME = precog DISPLAY_NAME = precog MUST_CHANGE_PASSWORD = FALSE DEFAULT_WAREHOUSE = precog;\n      GRANT ROLE precog TO USER precog;\n      ALTER USER precog SET default_role=precog;\n      GRANT USAGE ON ALL SCHEMAS IN DATABASE precog TO ROLE precog;\n      GRANT USAGE ON FUTURE SCHEMAS IN DATABASE precog TO ROLE precog;\n      GRANT ROLE precog TO ROLE sysadmin;\n      \n      6) Enable the “All queries” checkbox.\n      7) Click “Run”.\n      \n      You now have a database, warehouse, and user named precog with the password <pw>.\n      \n      Return to your Precog data pipeline and click \"Edit destination\".\n      \n      Change the username, warehouse and database to precog\n      \n      Change the password to the password you specified in the prior steps.\n      \n      Click \"Save\" then try again."
    },
    {
      "errorRegex": ".*Exception encountered for HTTP request.*Name or service not known.*",
      "solution": "Your Snowflake destination could not be written to because your account is incorrect. Please edit your destination and correct your account. Then try again."
    },
    {
      "errorRegex": "This session does not have a current database",
      "solution": "Please edit your destination and ensure the correct database name has been provided, then please go to https://app.snowflake.com and ensure that the user has a default role which has access to this database then try again."
    },
    {
      "errorRegex": "Table .* does not exist",
      "solution": "The tables Precog created in your Snowflake database no longer exist. Please either recover these tables and try again or remove and re-add the datasets to the pipeline so that Precog can re-create them."
    },
    {
      "errorRegex": ".*Object '.*/' does not exist or not authorized.*",
      "solution": "The tables Precog created in your Snowflake database no longer exist. Please either recover these tables and try again or remove and re-add the datasets to the pipeline so that Precog can re-create them."
    },
    {
      "errorRegex": ".*No active warehouse selected in the current session.  Select an active warehouse with the.*",
      "solution": "The warehouse name in your destination is incorrect, please enter the correct name and try again. "
    },
    {
      "errorRegex": ".*Certificate for .* doesn't match any of the subject alternative names.*",
      "solution": "Your Snowflake URL is incorrect. Sign into your Snowflake account. In the bottom left navigation click on the account manager option. This option may have a Snowflake icon or the user name, role, and initials. Roll your mouse over the account and copy your account URL by clicking on the link icon at the top of the dialogue box. Click on ‘Edit destination’ and paste the entire URL in the Account field. Save your destination edits. In your Pipeline click on the ‘Reload datasets’. Select the datasets, and then click on ‘Reload selected datasets’’. Click on the ‘Reload only’ option to connect to your Snowflake destination."
    },
    {
      "solution": "Your Snowflake URL is incorrect. Sign into your Snowflake account. In the bottom left navigation click on the account manager option. This option may have a Snowflake icon or the user name, role, and initials. Roll your mouse over the account and copy your account URL by clicking on the link icon at the top of the dialogue box. Click on ‘Edit destination’ and paste the entire URL in the Account field. Save your destination edits. In your Pipeline click on the ‘Reload datasets’. Select the datasets, and then click on ‘Reload selected datasets’’. Click on the ‘Reload only’ option to connect to your Snowflake destination..",
      "errorRegex": ".*HTTP status=403.*"
    },
    {
      "solution": "Your Snowflake service configuration is currently blocking connections from Precog. To resolve this, add 44.205.118.35 and 3.73.24.30 as allowed IP address in the Snowflake network policies. For more information refer to https://docs.snowflake.com/en/user-guide/network-policies",
      "errorRegex": ".*IP ([0-9\\.]+) is not allowed to access Snowflake.*"
    },
    {
      "solution": "Your Snowflake password has expired. Please login into your Snowflake account using the web console and update your password. Then edit your Snowflake destination with your new password",
      "errorRegex": ".*Specified password has expired.  Password must be changed using the Snowflake web console.*"
    },
    {
      "solution": "Tables from this dataset have been altered in Snowflake. Please reload it. In the future we suggest using views or creating new tables based on this one rather than altering it.",
      "errorRegex": ".* invalid identifier.*"
    },
    {
      "errorRegex": ".*Insufficient privileges to operate on database.*",
      "solution": "Insufficient privileges to operate on database, please check the ensure the credentials provided in your destination have sufficent privledges in snowflake and try again."
    },
    {
      "errorRegex": ".*Failed to initialize pool*",
      "solution": "The details you provided for your Snowflake destination are incorrect and causing a networking failure, please edit your destination correcting any details then reload."
    },
    {
      "errorRegex": "(.*SQL execution internal error.*)",
      "solution": "Encountered an internal error in Snowflake. This can either be a temporary Snowflake outage or a bug in Snowflake. Please try again. If the error persists please contact Snowflake support."
    }
  ],
  "kindId": {
    "name": "snowflake",
    "version": {
      "major": {
        "$numberInt": "1"
      },
      "minor": {
        "$numberInt": "0"
      },
      "patch": {
        "$numberInt": "0"
      }
    },
    "type": "destination"
  },
  "moduleId": "snowflake-destination"
}
